Repository: common-repository/buddypress-group-folders
Catalog: bp-gfold-i18n/bp-gfold-*.po
Languages: fi

source: Group Folders
fi: Ryhmien kansiot

source: Normal
fi: Normaali

source: Restricted
fi: Rajoitettu

source: Anyone can access a file if they know the precise filename.
fi: Kuka tahansa voi avata tiedoston jos tietää sen tarkan osoitteen.

source: Filenames are obfuscated to be difficult to guess.
fi: Osoitteista tehdään pitkiä ja erittäin vaikeasti arvattavia.

source: Upload failed.
fi: Lähetys epäonnistui.

source: Done!
fi: Lähetys valmis!

source: All done!
fi: Lähetys valmis!

source: 1 file uploaded successfully.
fi: 1 tiedosto lähetettiin onnistuneesti

source: %s files uploaded successfully.
fi: %s tiedostoa lähetettiin onnistuneesti.

source: Upload
fi: Lähetä

source: Uploading
fi: Lähetetään

source: Upload failed
fi: Lähetys epäonnistui

source: Authentication error
fi: Käyttäjäoikeusvirhe

source: Confirm delete: "%s"
fi: Vahvista poisto: "%s"

source: Rename "%s":
fi: Nimeä "%s":

source: Failed to delete.
fi: Poisto epäonnistui.

source: Failed to rename.
fi: Nimeäminen epäonnistui.

source: Failed to rename. The file may have just been renamed or deleted.
fi: Nimeäminen epäonnistui. Tiedosto on saatettu juuri nimetä tai poistaa.

source: (nothing yet)
fi: (ei mitään vielä)

source: Folder name
fi: Kansion nimi

source: Files
fi: Tiedostot

source: Allowed groups
fi: Sallitut ryhmät

source: Maximum file size
fi: Tiedoston sallittu koko

source: Maximum folder size
fi: Arkiston sallittu koko

source: Store folders under path
fi: Tiedostopolku

source: Outsider access
fi: Ulkopuolisten pääsy

source: When out of space
fi: Tilan loppuessa

source: Delete older files automatically
fi: Poista automaattisesti vanhoja tiedostoja

source: b,kb,MB,GB,TB,PB
fi: t,kb,MB,GB,TB,PB

source: open
fi: avaa

source: download
fi: lataa

source: rename
fi: nimeä

source: delete
fi: poista

source: Untitled
fi: Nimetön
